@file:Suppress("DEPRECATION")

package com.mohamedwessam.mamacoco.ChildrenStories

import android.content.res.Configuration
import android.support.v7.app.AppCompatActivity
import android.os.Bundle
import android.view.View
import android.widget.SeekBar
import com.mohamedwessam.mamacoco.R
import kotlinx.android.synthetic.main.activity_children_story_preview.*
import kotlinx.android.synthetic.main.children_stories_custom_menu.*
import java.util.*

class ChildrenStoryPreview : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_children_story_preview)

        //set local language to keep the design save
        val locale = Locale("en")
        Locale.setDefault(locale)
        val config = Configuration()
        config.setLocale(locale)
        baseContext.resources.updateConfiguration(config, baseContext.resources.displayMetrics)

        //set text size
        txt_children_preview.textSize = resources.getDimension(R.dimen.txt_children_stories_preview_size_normal)
        custom_menu_btn_font_m.setOnClickListener {
            txt_children_preview.textSize = resources.getDimension(R.dimen.txt_children_stories_preview_size_large)
            custom_menu_btn_font_m.visibility = View.GONE
            custom_menu_btn_font_l.visibility = View.VISIBLE
        }
        custom_menu_btn_font_l.setOnClickListener {
            txt_children_preview.textSize = resources.getDimension(R.dimen.txt_children_stories_preview_size_small)
            custom_menu_btn_font_l.visibility = View.GONE
            custom_menu_btn_font_s.visibility = View.VISIBLE
        }
        custom_menu_btn_font_s.setOnClickListener {
            txt_children_preview.textSize = resources.getDimension(R.dimen.txt_children_stories_preview_size_normal)
            custom_menu_btn_font_s.visibility = View.GONE
            custom_menu_btn_font_m.visibility = View.VISIBLE
        }

        //set custom menu back button
        custom_menu_btn_back.setOnClickListener {
            finish()
        }

        //set custom menu brightness button
        custom_menu_btn_brightness.setOnClickListener {
            custom_menu_all_layers.visibility = View.GONE
            brightness_seekBar.visibility = View.VISIBLE
        }
        var backLightValue: Float

        brightness_seekBar.setOnSeekBarChangeListener(object : SeekBar.OnSeekBarChangeListener {
            override fun onProgressChanged(seekBar: SeekBar?, progress: Int, fromUser: Boolean) {
                backLightValue = progress.toFloat()
                var layoutParams = window.attributes
                layoutParams.screenBrightness = backLightValue / 225
                window.attributes = layoutParams
            }

            override fun onStartTrackingTouch(seekBar: SeekBar?) {
            }

            override fun onStopTrackingTouch(seekBar: SeekBar?) {
                brightness_seekBar.visibility = View.GONE
                custom_menu_all_layers.visibility = View.VISIBLE
            }
        })

        //Stories
        val homarBolbol =
            "كان هناك حمار يقف ساعات بالنهار والليل ينهق بصوت عالي وصوته يرن لمن حوله وعندما يسمع صوته العالي يرن يفرح ويهز ذيله يميناً ويساراً ظناً منه أنه مطرباً وصوته اجمل من صوت البلابل والعصافير." + "\n" + "وفي يوم من الأيام رأى الحمار أصدقائه من الطيور مجتمعين حول شجرة كبيرة خضراء والبلبل يغني في الوسط في سعادة وبعد انتهائه صفق له جميع الطيور اعجابًا وثناءاً على صوته ." + "\n" + "وهنا وقف الحمار بين الطيور ليغني بصوته الذي كان يظن انه جميل ومميز افضل من صوت الطيور، بدأ يغني ويرفع صوته ويتمايل بذيله يميناً ويساراً، متباهياً بنغمة صوته الصاخبة." + "\n" + "بدأ يغني ويقول: انا الحمار يا عين يا ليل، صوتي جميل ليس له مثيل رغم إني حمار، أنا صوتي جميل، وبعد أن انتهى وقف منتظراً التحية والتصفيق والإعجاب من الطيور إلا انه لم يعجب بصوته أحد." + "\n" + "ذهب الحمار وترك الطيور وهو خجلان من ذاته ويقول: أنا حيوان بيدين ورجلين، انما هم طيور بأجنحة تطير، لا يفهمون في الغناء لذا فلم يصفق احد لي، أنا سأذهب الى الحيوانات ذات الأرجل والأيدي هي من تستطيع أن تقدر جمال صوتي ." + "\n" + "تحرك الحمار ليجد أمامه بقرة وحصان وغزال وخروف يسيرون في وسط الغابه فجرى اليهم مسرعاً ليغني، وبالفعل بدأ في الغناء والتمايل بذيله كما فعل أمام الطيور من قبل، وبدأ يقول: يا عين يا ليل، صوتي جميل ليس له مثيل رغم أني حمار ، صوتي جميل." + "\n" + "وأثناء غنائه تفاجأ بأن البقرة أخذت الحصان وذهبت بعيداً، والغزال هرب مع الخروف وظل هو وحيداً، جلس الحمار تحت الشجرة حزيناً يفكر في حاله وفيما حدث معه وشكله أمام حيوانات الغابة." + "\n" + "قال الحمار لنفسه لقد غنيت للطيور فهربت مني، وغنيت للحيوانات فإبتعدت عني، لم يبقى سوى ان اغنى للآدميين." + "\n" + "وأثناء ذلك سمع البلبل الذي كان يقف أعلى الشجرة الخضراء حديث الحمار مع نفسه وقال له: هل ترغب في معرفة السبب؟" + "\n" + "قال الحمار: نعم أريد السبب." + "\n" + "قال البلبل: ولكنك ستغضب ." + "\n" + "قال الحمار: لا لن أغضب، تفضل تحدث وقل الحقيقة." + "\n" + "قال البلبل: صوتك يرن رنيناً عالياً." + "\n" + "قال الحمار :نعم صحيح." + "\n" + "قال البلبل: لكن في الحقيقة صوتك لا يطرب، صوتك نشاز." + "\n" + "حزن الحمار حزناً شديداً واغتاظ من كلام البلبل الذي أوجعه بهذه الحقيقية المحزنة." + "\n" + "قال الحمار: أنا صوتي نشاز إذاً علي أن لا اغني مرة اخرى." + "\n" + "قال البلبل: نعم لا تغني ثانياً فهذه نصيحتي لك يا صديقي." + "\n" + "ففرد البلبل جناحه وطار تاركاً الحمار يغلي في غيظه، واثناء تفكير الحمار في حل رأى الشاطر سعيد يدق على طبلته مسروراً، بدأ الجمار ينتبه لدقات الطبلة و يقلدها برجله بدقة وترتيب ونظام يجعل دقاته في غاية الجمال." + "\n" + "فرح الحمار بهذا الإنجاز، وسارع الى أصدقائه يخبرهم بأنه نجح في إستبدال الغناء بالدق على الطبلة بقدمه، موجهاً الشكر الى صديقه البلبل الذي نصحه بالتوقف عن الغناء لأنه بسببه أكتشف الدق بصوت الطبلة." + "\n" + "فقال البلبل: من اليوم سأعتمد عليك، انا سأغني وانت ستطبل وبهذه الطريقة سيصبح غنائي أفضل." + "\n" + "وبعدها فرح الحمار وبدأ يشارك في كافة الحفلات يقف ويدق برجليه دقات الطبلة، ويصفق له اصدقائه وهم في سرور، ومع الوقت كثف الحمار جهده حتى أصبحت شهرته كبيرة وحاز بإعجاب الجميع."
        val namlaHamama =
            "يحكي أن نملة صغيرة خرجت لكي تقوم بجمع الطعام مع أصدقائها، ولكن ابتعدت عن أصدقائها وظلت تمشي بحثا عنهم وبعد فترة شعرت النملة بتعب شديد وعطش شديد.\n" +
                    "رأت الحمامة وهي تطير النملة، ولاحظت انها متعبة فتوقفت عن الطيران وقالت للنملة ماذا بكي؟ فقالت لها النملة انها متعبة وتشعر بالعطش الشديد فقالت لها الحمامة أن هناك نهر صغير قريب منها ووصفت لها مكان النهر وقالت لها انها سوف تطير فوقها لترشدها على مكان النهر.\n" +
                    "وصلت النملة الى النهر وعندما كانت تشرب جرفها النهر فأسرعت الحمامة لإنقاذها حيث كسرت غصن من الشجرة ورمته أمام النملة لكي تمسك فيه.\n" +
                    "نجت النملة من الغرق ثم ساعدت الحمامة النملة للوصول إلى اصدقائها ،فشكرتها النملة على ما فعلته معها ووعدتها برد الجميل يوما ما.\n" +
                    "وفي أحد الأيام خرجت النملة لجمع الطعام فشاهدت صياد يحاول اصطياد صديقتها الحمامة فكرت النملة كيف تنقذ صديقتها الحمامة من الصياد.\n" +
                    "أرعت النملة ولدغت الصياد فصرخ الصياد ولاحظته الحمامة وطارت بسرعة بعيدا عنه، وشكرت الحمامة النملة، فقالت لها النملة من يفعل الخير يرد له وانتى ساعدتني ولن انسي ما فعلتيه معي، وظلت الحمامة صديقة دائمة للنملة."
        val asadFar =
            "كان الأسد ينام في الغابة بعد أن انتهى من تناول الغداء، بينما كان الفأر صغير في السن وكان يحب اللعب، قام باللعب على ظهر الأسد، عندها استيقظ الأسد من نومه، وغضب بشدة لأن الفأر أزعجه، عندها مسك الفأر بأنيابه واستعد ليأكله، بينما الفأر الصغير توسل إليه أن يتركه، ولن يكرر فعلته هذه، عندها تركه الأسد، فرح الفأر ووعد أن يساعد الأسد.\n" +
                    "ضحك الأسد كيف لفأر مسكين ضعيف أن يساعده!\n" +
                    "ولكنه أثناء سيره في الغابة، وقع في شباك الصياد، عندها زأر الأسد بشدة، وسمع الفأر صوت الأسد، وتوجه إليه، وقام بقطع الحبال عن طريق أسنانه الحادة، خرج الأسد من الشباك بعد أن أنقذه الفأر وشكره.\n" +
                    "وتعلم الأسد أن الضعيف يمكنه مساعدة الأقوى."
        val arnabSolhefa =
            "يحكي أنه كان هناك ارنب يعيش في الغابة مع الحيوانات وفي يوم من الأيام خرجت السلحفاة فراها الارنب ودار بينهما حديث.\n" +
                    "قال الارنب للسلحفاة انا افضل منك في كل شيء فانا سريع وجميل اما انتي بطيئة ومملة.\n" +
                    "فقالت له لا تكن مغرور أيها الارنب واتفق الارنب معها على أن يسابقها ليثبت لها أنه الأفضل فوافقت السلحفاة.\n" +
                    "وعندما بدء السباق سبق الارنب السلحفاة كثيرا ونظر إلى الخلف فوجدها لازالت تبعد عنه كثيرا فجلس اسفل الشجرة كي يستريح قليلا حتى تقترب منه السلحفاة وأثناء جلوسه اسفل الشجرة نام الارنب.\n" +
                    "وعندما استيقظ من النوم نظر خلفه ولم يجد السلحفاة فظن انها لا تزال بعيدة فاسرع ليكسب السباق وعندما وصل إلى النهاية وجد أن السلحفاة قد سبقته وكانت تحتفل مع حيوانات الغابة بهذا النصر الكبير.\n" +
                    "لم يصدق الارنب ما حدث وظل يقول كيف يحدث ذلك؟ فانا الاسرع فقالت له الحيوانات لا تكون مغرور أيها الارنب ولا تستهين ابدا بقوة أحد فقد يكون افضل منك في اشياء اخرى.\n" +
                    "بعدها عاش الارنب بسيط ومتواضع وعرف أن الله ميز كل مخلوق بميزة لا توجد في غيرة من المخلوقات."
        val taalabMakar =
            "كان يا مكان في قديم الزمان في الغابة الكبيرة يعيش أرنب كبير مع إبنه يقضيان يومهما في سعادة وسرور.\n" +
                    "وفي يوم من أيام الشتاء حيث برودة الطقس وقلة الطعام، شعر الأرنب الصغير بالجوع فطلب من أبيه أن يحضر له الطعام.\n" +
                    "خرج الأب ليبحث عن طعام لأبنه الجائع وقبل خروجه قام بتحذيره جيداً أن لا يخرج حتى لا يأكله الثعلب.\n" +
                    "تأخر الأرنب الكبير فأشتد الجوع على ابنه وما كان منه إلا أن خرج ليبحث عن والده في الغابة، وفي أثناء بحثه قابله الثعلب المكار الذي كان يحوم بين الأشجار بحثاً عن أي شيء يأكله، وبمجرد أن ظهر أمامه الأرنب الصغير الجائع، بدأ الثعلب في التخطيط لحيلة لإيقاع الأرنب كوجبة شهية له، فعرض على الأرنب أن يذهب معه ليعطيه الكثير من الطعام، وبالفعل ذهب الأرنب مع الثعلب الذي كان يخطط لأكله.\n" +
                    "وفي هذا الوقت عاد الأرنب الكبير الى منزله وهو يحمل العشب الأخضر لأبنه الجائع الذي بحث عنه داخل البيت ولم يجده.\n" +
                    "خرج الأرنب الكبير يبحث عن صغيره في الغابة فالتقى الدجاجه وسأله عن إبنه إلا أنها نفت رؤيته، فطلب منها أن تبحث معه عليه، ثم التقى بالبطة وسألها عنه إلا انها هي الأخرى لم تستطيع أن تفيده بأي معلومة، فطلب منها أيضا ان تبحث معه، وتابع الأرنب البحث عن ابنه وكلما قابل أحد الحيوانات طلب منه الذهاب معه للبحث. \n" +
                    "واصل الأرنب البحث عن صغيره حتى وجد الهدهد فسأله: هل رأيت الأرنب الصغير؟ قال الهدهد: نعم لقد رأيته يسير مع الثعلب المكار في الطريق الى بيت الثعلب، سارع الأرنب الكبير هو ومن معه من الحيوانات الى بيت الثعلب ونظروا من الشباك ليجدوا الثعلب يحضر وعاء كبيرة فوق النار بها ماء ينوي أن يقوم بطهي الأرنب الصغير الذي كان يقف بجوار الثعلب.\n" +
                    "بدأت الحيوانات في التفكير في خطة لإنقاذ الأرنب الصغير، وهنا وقف الأرنب الكبير على النافذه ينادي للصغير، فرد عليه الثعلب قائلاً: تعالى معنا فنحن نحضر طعام شهي، قال الأرنب الكبير: لا أستطيع النزول، فهل يمكنك أن تساعدني؟ فقفز الثعلب مسرعا لإحضار الأرنب الكبير وهو يطمع في وجبة دسمة من أرنبين.\n" +
                    "وما إن دخل الأرنب الكبير حتى تبعته كافة الحيوانات الأخرى التي هجمت على الثعلب المكار ودفعت به داخل القدر.\n" +
                    "وفي النهاية أعتذر الأرنب الصغير لوالده عن عدم انصياعه لأوامره، وعاد الجميع الى بيته في سعادة."
        val taalabYakolAmar =
            "ذات ليلة مُقمرة، كان الثعلب المكار يطوف متخفياً حول إحدى المزارع بحثاً عن فريسة يصطادها لوجبة عشاء دسمة،  بعد يوم طويل وشاق وبعد طول انتظار صادفته قطة صغيرة.\n" +
                    "بدأ الثعلب يفكر بتمهل فعلى الرغم من صغر حجم القطة إلا أنها مليئة باللحم لذلك فقد آثر أكلها لسد طنين بطنه والى حين العثور على شيء أفضل منها .\n" +
                    "وبمجرد أن استعد الثعلب للهجوم على القطة لأكلها، انتبهت اليه من بعيد وتحدثت في رجاء: أناشدك أن لا تأكلني وأعدك أن أخبرك بالمكان الذي يُخبيء به الفلاح صاحب المزرعة الجبن اللذيذ، تعالى معي وسأريك بنفسك.\n" +
                    "ولأن الثعلب دائماً طماع، فصدق القطة الصغيرة وسال لعابه وهو يسير ورائها أملاً في التلذذ بقطع الجبن رائعة المذاق.\n" +
                    "وعندما وصلا قالت القطة: والآن، انظر في الأسفل وسترى ألذ جبن ستأكله في حياتك.\n" +
                    "نظر الثعلب الجائع الى داخل البئر، ودقق به ليرى صورة القمر وهو في ليلة تمامه منعكسه داخل ماء البئر، فظن الثعلب الطماع أن صورة القمر هي قطعة الجبن الكبيرة، ففرح وازداد لعابه في الإنسياب. \n" +
                    "قفزت الهرة الصغيرة مسرعة داخل الدلو الموجود بأعلى البئر، ثم قالت للثعلب: للحصول على هذه القطعة الكبيرة من الجبن عليك النزول مثلي بالدلو الى أسفل، استخدمت القطة الصغيرة ذكائها للتخلص من الثعلب فهي تعرف الطريق الى أسفل البئر وتعرف كيف يمكنها الخروج منه، ثم خرجت من الدلو وأمسكت بالحبل.\n" +
                    "ظل الثعلب مراقباً ما تفعله ثم نادى بصوت عالي: لماذا لا تحملين قطعة الجبن معك الى أعلى؟\n" +
                    "أجابت القطة: لا أستطيع لأنها ثقيلة جداً وأنا صغيرة، ماعليك سوى ان تنزل الى هنا لتأخذها وتصعد على الفور.\n" +
                    "لم يفكر الثعلب كثيراً أمام جوع بطنه، فدخل الى الدلو الكبير وبمجرد أن جلس به حتى سقط الدلو الى الأسفل ليغمره الماء دون أن يستطيع الثعلب انقاذ نفسه، وهنا صعدت القطة في الطرف التاني من الحبل.\n" +
                    "لقد نجحت القطة الصغيرة بذكائها ان تهرب من أسنان ومخالب الثعلب."
        val namlaSarsor =
            "النملة والصرصور أصدقاء عاشوا معًا في الغابة، كانت النملة تتميز بالنشاط والحيوية، حيث أن العمل عندها أساس الحياة، عكس الصرصور الذي كان كسول غير نافع، كان يقضي الوقت في اللعب والغناء، وكان يسخر من النملة، يخبرها أن فصل الصيف للعب لا للعمل والتعب، كانت النمل غاضبة من صديقها الكسول.\n" +
                    "كل يوم النملة تذهب في نشاط تجمع الحبّ وتقوم بوضعه في المنزل، كان الصرصور يتعجب، لكن النملة أخبرته أنها تجمع الحبّ لكي تأكل منه، وتقوم بتخزين الباقي لفصل الشتاء، وأخبرته أن الشتاء شديد البرودة وأحياناً يتساقط المطر، ولن يتمكن من إيجاد الطعام، لكن الصرصور لم يسمع كلامها وكان دائم اللعب.\n" +
                    "ذات يوم مر الصرصور من أمام النملة، وجدها تقوم بحفر منزل لها داخل الأرض، كانت تقوم بأخذ التراب بفمها وتقوم برميه خارج الأرض، حتى تتمكن من صنع حفرة كبيرة، ضحك الصرصور وسخر منها، كيف تبني لك منزل، مازال الجو ممتع في الخارج، لكن النملة كانت تعرف جيدًا أن فصل الصيف غير دائم، وأن المنزل سوف يحميها من برد الشتاء، ومن رياح الخريف المليئة بالأتربة.\n" +
                    "النملة والصرصور كانوا صديقين متناقضين في كل شئ، حتى جاء وقت الشتاء، جميع الحيوانات كانت تعمل بنشاط بما فيهم النملة، بينما الصرصور كان يقضى كل الوقت في اللعب، وعندما شعر بالبرد بحث عن مكان يحميه، ولكنه لم يجد، لأنه لم يقم ببناء منزل له، وكان وجودة في الخارج أمر مستحيل لأن الأمطار تساقطت وأغرقت كل شئ، كان يرتجف من البرد.\n" +
                    "بعد وقت شعر الصرصور بالجوع الشديد، وكانت في الداخل تجلس النملة والصرصور ينظر إليها في الخارج من النافذة، وجد أن النملة قامت بصنع حساء لذيذ وكانت تتناوله مع حبات الأرز، وكان المنزل دافئ يحميها من البرد ومن المطر، عرف الصرصور أنه مخطئ ولكنه لكن متردد في طلب المساعدة من النملة، لأنها من الممكن أن ترفض، حيث كانت تعمل بجد ونشاط، بينما هو يلهو ويلعب.\n" +
                    "سمعت النملة صوت بكاء في الخارج، خرجت مسرعة، وجدت أن الصرصور يجلس ويبكي بشدة، سألته النملة عن السبب، أخبرها انه يشعر بالبرد والجوع، قالت له النملة: \"يمكنك الدخول يا عزيزي، وتناول الطعام معي، والنوم في غرفتي، لدي فراش أعددته لك، ولكن عليك العمل في الصيف القادم وبناء منزل يحميك من البرد والمطر والعواصف\".\n" +
                    "شكر الصرصور معروف النملة معه، وقام بتناول الطعام حتى شعر بالدفئ، ثم ذهب للنوم، وعندما عاد فصل الصيف، أخذ يجمع معها الطعام وقام ببناء منزل، وتعلم الصرصور أن الكسل يسبب المتاعب."
        val sayadKanooa =
            "حامد وعلي أخوين يعملون بصيد السمك، كان حامد يمتلك قارب صغير ويخرج كل يوم لصيد السمك ثم يذهب للسوق في آخر النهار ويبيع ثلث السمك الذي اصطاده ويعطي الفقراء والمساكين الثلث الثاني والثلث الأخير يعود به إلى زوجته وأولاده وأبيه وأمه وكان حصتهم من السمك  لا تكفيهم ولكنهم كانوا يشكرون الله كما علمهم أبوهم حامد.\n" +
                    "كان حامد طيب القلب ويحب الناس وفعل الخير ويرعى أبويه، على عكس أخيه علي فقد كان علي لديه قارب كبير وكان يصطاد الكثير من السمك ويذهب آخر النهار إلى السوق ويبيعه كله بسعر عالي ولم يكن يعطي أي شيء للفقراء والمساكين فهو كان طماع وﻻ يشكر الله أبدا.\n" +
                    "وكان على دائما يسخر من أخيه حامد على ما يفعله من أعمال الخير لأن علي كان شخص طماع وقاسي القلب ولا يحب أحد غير نفسه فقط.\n" +
                    "وذات يوم كان حامد وعلي جالسان يصطادان فجاء رجل ومعه العديد من الأغراض وطلب من حامد أن ينقله بقاربه إلى الجزيرة التي تقع على الضفة الأخرى من النهر وسوف يعطيه الكمية التي سيطلبها من القمح وافق حامد وقال له سوف آخذ منك ثلاثة أقداح من القمح فقط..\n" +
                    "ولما سمع على كلام الرجل قال له ما رأيك أن تأتي وتركب معي أنا أفضل فقاربي أكبر من قاربه ولكن سوف تعطيني ما أريد من القمح قال له الرجل لا فأنا أريد الركوب في ذلك القارب الصغير وسوف أضع أغراضي في قاربك الكبير.\n" +
                    "وبدأ القاربان بالتحرك في النهر حتى وصلا إلى الجزيرة، أخذهم الرجل إلى بيته واستضافهما وقدم لهم واجب الضيافة ثم اخذهم إلى مخزن كبير ملئ بالقمح الكثير.\n" +
                    "قال لهم الرجل كل واحد منكم يأخذ ما شاء من ذلك القمح فقال حامد أنا سآخذ الثلاثة أقداح فقط التي أتقفت عليها معك أما علي فأخذ كميات كبيرة جدا من القمح حتى امتلاء القارب وغادر حامد وعلي الجزيرة.\n" +
                    "كان قارب حامد يسير بسهولة في الماء، أما قارب علي كان ﻻ يسير في الماء وبداء بالنزول أسفل سطح الماء وكادت أن تدخل به الماء فقام علي بإلقاء بعض القمح في الماء حتى لا يغرق القارب.\n" +
                    "وبعد وقت قليل بدأت الماء تدخل في قارب على، أنفزع علي وقام بإلقاء باقي القمح في النهر وهو يشعر بالحسرة ولكن امتلاء القارب بالماء ولم يستطيع على إفراغ القارب من الماء لكثرتها وبدأ القارب بالغرق ولما نظر حامد خلفه وجد قارب أخيه على قد غرق في الماء فقفز مسرعا في الماء وأنقذ أخيه علي من الغرق وصعد به إلى قاربه الصغير.\n" +
                    "كان علي يشعر حسرة كبيرة على قاربه الذي غرق في الماء بسبب طمعه، ولما وصل الأخوين إلى الشاطئ قال حامد لأخيه علي أنظر إلى حالك وما وصلت إليه بسبب طمعك وعدم قناعتك بالقليل، فقال له على أنت على حق يا أخي لو كنت رضيت بالقيل لكان قاربي معي الآن."

        //receiving position and set Story Pic and Text
        var pos = intent.getIntExtra("key", 0)
        when (pos) {
            0 -> {
                custom_menu_txtview.text = "الحمار والبلبل"
                txt_children_preview.text = homarBolbol
                image_view_children_preview.setImageResource(R.drawable.homar_bolbol1)
            }
            1 -> {
                custom_menu_txtview.text = "النملة والحمامة"
                txt_children_preview.text = namlaHamama
                image_view_children_preview.setImageResource(R.drawable.namla_hamama1)
            }
            2 -> {
                custom_menu_txtview.text = "الثعلب المكار"
                txt_children_preview.text = taalabMakar
                image_view_children_preview.setImageResource(R.drawable.taalab_makar)
            }
            3 -> {
                custom_menu_txtview.text = "الأسد والفار"
                txt_children_preview.text = asadFar
                image_view_children_preview.setImageResource(R.drawable.asad_far)
            }
            4 -> {
                custom_menu_txtview.text = "الأرنب والسلحفاة"
                txt_children_preview.text = arnabSolhefa
                image_view_children_preview.setImageResource(R.drawable.arnab_solhefa)
            }
            5 -> {
                custom_menu_txtview.text = "الثعلب يأكل القمر"
                txt_children_preview.text = taalabYakolAmar
                image_view_children_preview.setImageResource(R.drawable.taalab_yakol_amar)
            }
            6 -> {
                custom_menu_txtview.text = "النملة والصرصور"
                txt_children_preview.text = namlaSarsor
                image_view_children_preview.setImageResource(R.drawable.namla_sarsour)
            }
            7 -> {
                custom_menu_txtview.text = "الصياد القنوع"
                txt_children_preview.text = sayadKanooa
                image_view_children_preview.setImageResource(R.drawable.sayad_kanooa)
            }
        }

    }

}